{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Звіт до роботи\n",
    "## Тема: Робота з бібліотекою Numpy \n",
    "### Мета роботи: Навчитися використовувати бібліотеку NumPy в Python.\n",
    "---\n",
    "### Виконання роботи\n",
    "- Результати виконання завдання *1-8*;\n",
    "    - 1. Переглянув основи роботи з даною бібліотекою наводяться у офіційній документації NumPy: the absolute basics for beginners\n",
    "    - 2. Для роботи з бібліотекою будемо працюю в Jupytere Notebook.\n",
    "    - 3. Уважно переглянув код, постарався зрозуміти чому виводяться саме такі значення. Звернув увагу на конструкції мови Python.\n",
    "    - 4. Виконайте код/приклади наведені в Notebook. Модифікував Notebook та виконав завдання в jupiter notebook.\n",
    "    - 5. Скрізь де є функція homework яка виводить повідомлення з позначкою >>>>> - це завдання які я виконав!\n",
    "    - 6. Пояснив чому виводиться саме такий результат, створіть свій print з поясненнями, виконав вказані завдання;\n",
    "    - 7. Визначив за якою формулою генеруються значення для методу arange. Визначив формулу для методу linspace. Порівняв формули.\n",
    "    - 8. Створив декілька простих Векторів та Матриць та вивів їх розмірність. Виконав арифметичні операції над створеними Векторам/Матрицями;\n",
    "\n",
    "- Виконані завдання: https://github.com/yumylymuk/mathematic-DO/blob/main/3/2.ipynb;\n",
    "- \n",
    "### Висновок: \n",
    "- :question: Що зроблено в роботі;\n",
    "- :question: Чи досягнуто мети роботи;\n",
    "- :question: Які нові знання отримано;\n",
    "- :question: Чи вдалось відповісти на всі питання задані в ході роботи;\n",
    "- :question: Чи вдалося виконати всі завдання;\n",
    "- :question: Чи виникли складності у виконанні завдання;\n",
    "- :question: Чи подобається такий формат здачі роботи (Feedback);\n",
    "- :question: Побажання для покращення (Suggestions);\n",
    "---\n",
    "- В даній роботі я навчив вас використовувати бібліотеку NumPy для роботи з масивами даних в Python.\n",
    "- Так, мета роботи була досягнута.\n",
    "- Якість вивчення NumPy підвищилась, вивчився синтаксис і функції бібліотеки для роботи з масивами даних.\n",
    "- Так, на всі питання задані в ході роботи було відповідно.\n",
    "- Да, всі завдання було успішно виконано.\n",
    "- У виконанні завдань не виникло складнощів.\n",
    "- Формат здачі роботи мені подобається.\n",
    "- Немає"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
